[Knight X2SoldierClassTemplate]
+DisplayName="骑士"
+ClassSummary="骑士擅长近战，他可以用剑造成致命打击，用盾牌使敌人失去方向并使其昏迷，或者通过增强护甲来提高自身的耐久性。"
+LeftAbilityTreeTitle="十字军"
+RightAbilityTreeTitle="冠军"
AbilityTreeTitles[0]="十字军"
AbilityTreeTitles[1]="圣骑士"
AbilityTreeTitles[2]="冠军"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Paladin"
+RandomNickNames[1]="Warrior"
+RandomNickNames[2]="十字军"
+RandomNickNames[3]="Hero"
+RandomNickNames[4]="Slayer"
+RandomNickNames[5]="冠军"